<?php

namespace Database\Seeders;

use DateTime;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AgriProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            "धान",
            "मकै",
            "गहुँ",
            "आलु",
            "जौ",
            "कोदो",
            "फापर",
            "उवा",
            "दाल",
            "रहर",
            "मुसरो",
            "चना",
            "सिमी",
            "भट्टमास",
            "राजमा",
            "वोड़ी",
            "गहत",
            "मास",
            "केराउ",
            "तोरी/सस्र्यु",
            "आलस/तिल",
            "सूर्यमुखी",
            "सिलाम",
            "बन्दा/काउली/रायो",
            "बोडी",
            "गोलभेंडा",
            "काँक्रो,लौका,फर्सी",
            "परबल,कुन्द्रुक,काँक्रो",
            "करेला,घिरौला,चिचिण्डो",
            "मुला",
            "खोर्सानी",
            "बेथे",
            "भिन्डि",
            "किम्ची",
            "अदुवा/वेसार",
            "प्याज/लसुन",
            "च्याउ",
            "कफी",
            "चिया",
            "अलैंची",
            "आँप/लिची",
            "उखु",
            "केरा/मेवा",
            "सुन्तला/कागती (अमिलोेजात)",
            "स्याउ/आरुवखडा",
            "नास्पाति",
            "आम्बा",
            "अनार",
            "किवी",
            "खुर्पानी",
            "ओखर",
            "जुनार",
            "कटहर",
            "तितेपाती (जडीवुटी)",
            "पुट्रकी (जडीवुटी)",
            "गुर्जो (जडीवुटी)",
            "जटामसी (जडीवुटी)",
            "निर्मसी (जडीवुटी)",
            "पांचऔले (जडीवुटी)",
            "यार्सागुम्वा (जडीवुटी)",
            "चिराईतो (जडीवुटी)",
            "बनलसुन (जडीवुटी)",
            "सिलाजित (जडीवुटी)",
            "झयाल",
            "भुतकेश",
            "भोजपत्र",
            "दलिचिनी",
            "पाषणवेद",
            "सिकाकाई",
            "धुपिपात",
            "भलामी",
            "काँकडसिगी",
            "सतुवा",
            "उन्यु",
            "कर्कलो",
            "कुटकी",
            "अमला",
            "ईन्द्रेणी",
            "काँस",
            "काफलबोक्रा",
            "असुरो",
            "वज्रदन्ती",
            "आोखरबोक्रा",
            "अंगरी",
            "लौठसल्ला",
            "वनलसुन",
            "गनानी"
        ];

        foreach ($data as $key => $value) {
            DB::table('agri_product')->insert(
                [
                    'id'         => $key + 1,
                    'name'       => trim($value),
                    'created_at' => new DateTime,
                    'updated_at' => new DateTime,
                ],
            );
        }
    }
}
